Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: L<Perl News|http://perlnews.org/> covers some of the major events in the Perl world, L<Perl Weekly|http://perlweekly.com/> is a weekly e-mail (and RSS feed) of hand-picked Perl articles.
es: L<Perl News|http://perlnews.org/> cubre los principales eventos del mundo Perl. L<Perl Weekly|http://perlweekly.com/> es un boletín de correo electrónico (y canal RSS) semanal que incluye artículos sobre Perl seleccionados.

source: L<Perl.com|http://www.perl.com/> used to be part of the O'Reilly Network, a subsidiary of O'Reilly Media.
es: Anteriormente, Perl.com ( L<http://www.perl.com/> ) formaba parte de O'Reilly Network, una subsidiaria de O'Reilly Media.

source: L<Test::Simple|Test::Simple> and L<Test::More|Test::More> are good places to start when writing a test suite.
es: L<Test::Simple|Test::Simple> y L<Test::More|Test::More> son buenos puntos de partida para escribir una batería de pruebas.

source: L<Unicode::UCD/num()> can be used to sort this out.
es: Para solucionar este problema puede usar L<Unicode::UCD/num()>.

source: L<http://blogs.perl.org/> hosts many Perl blogs, there are also several blog aggregators: L<Perlsphere|http://perlsphere.net/> and L<IronMan|http://ironman.enlightenedperl.org/> are two of them.
es: L<http://blogs.perl.org/> hospeda muchos blogs sobre Perl. También hay varios agregadores de blogs, como L<Perlsphere|http://perlsphere.net/> o L<IronMan|http://ironman.enlightenedperl.org/>.

source: L<http://juerd.nl/site.plp/perlcheat> - home of the Perl Cheat Sheet
es: L<http://juerd.nl/site.plp/perlcheat> - Página de la hoja resumen de Perl

source: L<http://perlmonks.org/?node_id=216602> - the original PM post
es: L<http://perlmonks.org/?node_id=216602> - Artículo original de PM

source: L<http://perlmonks.org/?node_id=238031> - Damian Conway's Perl 6 version
es: L<http://perlmonks.org/?node_id=238031> - Versión para Perl 6 de Damian Conway

source: L<perlfaq> contains questions and answers related to many common tasks, and often provides suggestions for good CPAN modules to use.
es: L<perlfaq> contiene preguntas y respuestas relacionadas con muchas tareas comunes, y en muchos casos sugiere los módulos de CPAN adecuados para cada tarea.

source: L<perlmod> describes Perl modules in general.
es: En L<perlmod> se describen los módulos de Perl en general.

source: L<perlmod>, L<perlmodlib>, L<perlmodinstall>, L<h2xs>, L<strict>, L<Carp>, L<Exporter>, L<perlpod>, L<Test::Simple>, L<Test::More> L<ExtUtils::MakeMaker>, L<Module::Build>, L<Module::Starter> http://www.cpan.org/ , Ken Williams's tutorial on building your own module at http://mathforum.org/~ken/perl_modules.html
es: L<perlmod>, L<perlmodlib>, L<perlmodinstall>, L<h2xs>, L<strict>, L<Carp>, L<Exporter>, L<perlpod>, L<Test::Simple>, L<Test::More> L<ExtUtils::MakeMaker>, L<Module::Build>, L<Module::Starter>, http://www.cpan.org/ , y el tutorial de Ken Williams sobre cómo crear su propio módulo en http://mathforum.org/~ken/perl_modules.html

source: L<perlmodlib> lists the modules which came with your Perl installation.
es: L<perlmodlib> enumera los módulos incluidos en la instalación de Perl.

source: L<perlop/"Gory details of parsing quoted constructs">.
es: L<perlop/"Detalles complejos del análisis de construcciones entrecomilladas">.

source: L<perlop/"Regexp Quote-Like Operators">.
es: L<perlop/"Operadores de entrecomillado para expresiones regulares">.

source: L<zipdetails> displays information about the internal record structure of the zip file.
es: L<zipdetails> muestra información sobre la estructura de registros interna de un archivo zip.

source: LINE:
es: LINEA:

source: LISTs do automatic interpolation of sublists.
es: En una LISTA se interpolan automáticamente las sublistas.

source: Large numbers of other programmers will be using your code modules.
es: Muchos programadores van a utilizar sus módulos de código.

source: Larry 4.036 1993-Feb-05 Very stable.
es: Larry 4.036 1993-Feb-05 Muy estable.

source: Larry 5.000alpha12 1994-Aug-04
es: Larry 5.000alpha12 1994-Ago-04

source: Larry 5.000alpha9 1994-May-05 ext appears.
es: Larry 5.000alpha9 1994-May-05 Aparece ext.

source: Larry 5.000beta1 1994-Aug-30
es: Larry 5.000beta1 1994-Ago-30

source: Larry 5.000beta2 1994-Sep-14 Core slushified.
es: Larry 5.000beta2 1994-Sep-14 Núcleo parcialmente fundido.

source: Larry 0 Classified.
es: Larry 0 Confidencial.

source: Larry 1.000 1987-Dec-18
es: Larry 1.000 1987-Dic-18

source: Larry 5.002 1996-Feb-29 Prototypes.
es: Larry 5.002 1996-Feb-29 Prototipos.

source: Larry Wall <larry@wall.org>, with the help of oodles of other folks.
es: Larry Wall <larry@wall.org>, con la ayuda de muchas personas.

source: Larry Wall, Andy Dougherty, Tom Christiansen, Charles Bailey, Nick Ing-Simmons, Chip Salzenberg, Tim Bunce, Malcolm Beattie, Gurusamy Sarathy, Graham Barr, Jarkko Hietaniemi, Hugo van der Sanden, Michael Schwern, Rafael Garcia-Suarez, Nicholas Clark, Richard Clamp, Leon Brocard, Dave Mitchell, Jesse Vincent, Ricardo Signes, Steve Hay, Matt S Trout, David Golden, Florian Ragwitz, Tatsuhiko Miyagawa, Chris C<BinGOs> Williams, Zefram, Ãvar ArnfjÃ¶rÃ° Bjarmason, Stevan Little, Dave Rolsky, Max Maischein, Abigail, Jesse Luehrs and Tony Cook.
es: Larry Wall, Andy Dougherty, Tom Christiansen, Charles Bailey, Nick Ing-Simmons, Chip Salzenberg, Tim Bunce, Malcolm Beattie, Gurusamy Sarathy, Graham Barr, Jarkko Hietaniemi, Hugo van der Sanden, Michael Schwern, Rafael Garcia-Suarez, Nicholas Clark, Richard Clamp, Leon Brocard, Dave Mitchell, Jesse Vincent, Ricardo Signes, Steve Hay, Matt S Trout, David Golden, Florian Ragwitz, Tatsuhiko Miyagawa, Chris C<BinGOs> Williams, Zefram, Ævar Arnfjörð Bjarmasonn, Stevan Little, Dave Rolsky, Max Maischein, Abigail, Jesse Luehrs y Tony Cook.

source: Larry and the Perl development team occasionally make changes to the internal core of the language, but all possible efforts are made toward backward compatibility.
es: Ocasionalmente, Larry y el equipo de desarrollo de Perl realizan cambios en los componentes internos del lenguaje, pero siempre se hace lo posible por mantener la compatibilidad con las versiones anteriores.

source: Larry doesn't really care.
es: A Larry le da igual.

source: Larry has his reasons for each of these things, but he doesn't claim that everyone else's mind works the same as his does.
es: Larry tiene sus razones para cada una de estas preferencias, pero no aspira a que la mente de los demás funcione igual que la suya.

source: Last In, First Out.
es: I<Last In, First Out> (el último que entra es el primero que sale).

source: Last Updated: Fri, 29 Oct 1999 22:50:30 +0200
es: Última actualización: viernes, 29 de octubre de 1999 22:50:30 +0200

source: Later, we'll write accessors to manipulate this data.
es: Más adelante escribiremos métodos de acceso para manipular estos datos.

source: Lather, rinse, iterate.
es: Enjabonar, aclarar, repetir.

source: Legend: kB #
es: Rótulo: kB N.º

source: Length of the name.
es: Longitud del nombre.

source: Lengthening an array that was previously shortened does not recover values that were in those elements.
es: Alargar un array que ha sido acortado previamente no permite recuperar los valores que había en esos elementos

source: Leon 5.13.0 2010-Apr-20 The 5.13 development track
es: Leon 5.13.0 2010-Abr-20 Serie de desarrollo de v5.13

source: Let's assume we have two classes, C<Radio> and C<Computer>.
es: Supongamos que tenemos dos clases: C<Radio> y C<Equipo>.

source: Let's look at each of these principles in depth.
es: Veamos cada uno de estos principios en profundidad.

source: Let's now see how it's done.
es: Veamos la manera de hacerlo.

source: Let's say you'd like to match a number at the end of a string, and you also want to keep the preceding part of the match.
es: Suponga que desea buscar la coincidencia con un número al final de una cadena y mantener la parte que precede a esa coincidencia.

source: Let's take a simple patch from start to finish.
es: Vamos a crear un parche sencillo de principio a fin.

source: Let's take an example.
es: Veamos un ejemplo.

source: Let's write a real constructor for the C<File> class we used earlier:
es: Vamos a escribir un constructor real para la clase C<Archivo> usada previamente:

source: Lexically scoped aliases for package variables are explicitly created by the L<our|perlfunc/our> declaration.
es: La declaración L<our|perlfunc/our> crea explícitamente alias de ámbito léxico para las variables de paquete.

source: Like C<(*PRUNE)>, this verb always matches, and when backtracked into on failure, it causes the regex engine to try the next alternation in the innermost enclosing group (capturing or otherwise) that has alternations.
es: Al igual que C<(*PRUNE)>, este verbo siempre coincide, y cuando se da marcha atrás a causa de un error, hace que el motor de expresiones regulares intente la alternativa siguiente en el grupo contenedor más interno (de captura o de otro tipo) que tenga alternativas.

source: Like C<CLONE>, C<CLONE_SKIP> is called once per package; however, it is called just before cloning starts, and in the context of the parent thread.
es: Al igual que en el caso de C<CLONE>, se llama a C<CLONE_SKIP> una vez por paquete; sin embargo, en el caso de esta última, se llama justo antes de que comience la clonación, y en el contexto del hilo de ejecución primario.

source: Like C<CLONE>, C<CLONE_SKIP> is currently called with no parameters other than the invocant package name, although that may change.
es: Al igual que en el caso de C<CLONE>, el único parámetro usado en las llamadas a C<CLONE_SKIP> es el nombre del paquete que llama, aunque esto podría cambiar.

source: Like C<Moose>, C<Class::Accessor> generates accessor methods and a constructor for your class.
es: Al igual que C<Moose>, C<Class::Accessor> genera los métodos de acceso y un constructor para la clase.

source: Like a forked process, but without L</fork>'s inherent memory protection.
es: Igual que un proceso generado mediante C<fork>, pero sin la protección de memoria que conlleva el uso de L</fork>.

source: Likely candidates are: "op/stat", "lib/io_pipe", "lib/io_sock", "lib/io_udp" and "lib/time".
es: Los candidatos probables son: "op/stat", "lib/io_pipe", "lib/io_sock", "lib/io_udp" y "lib/time".

source: Likewise C is a backreference only if at least 11 left parentheses have opened before it.
es: Asimismo, \11 es una retrorreferencia solo si antes hay como mínimo 11 paréntesis de apertura.

source: Likewise the symbol table for the nested package mentioned earlier is named C<%OUTER::INNER::>.
es: De la misma forma, el nombre de la tabla de símbolos del paquete anidado mencionado previamente sería C<%EXTERIOR::INTERIOR::>.

source: Likewise, assigning a value to the special variable C<$|> (C<$AUTOFLUSH>) has the side effect of forcing a flush after every L<write|perlfunc/write> or L<print|perlfunc/print> on the currently selected filehandle.
es: Del mismo modo, la asignación de un valor a la variable especial C<$|> (C<$AUTOFLUSH>) tiene el efecto secundario de forzar un volcado en cada operación L<write|perlfunc/write> o L<print|perlfunc/print> en el identificador de archivo seleccionado actualmente.

source: Likewise, hashes included as parts of other lists (including parameters lists and return lists from functions) always flatten out into key/value pairs.
es: Del mismo modo, los hashes incluidos como parte de otras listas (incluidas las listas de parámetros y las listas de retorno de funciones) siempre se extienden en pares clave/valor.

source: Line numbers displayed by diagnostics are internally stored as short integers, so they are limited to a maximum of 65535 (higher numbers usually being affected by wraparound).
es: Por otra parte, los números de línea especificados por los diagnósticos se almacenan internamente como enteros cortos, por lo que están limitados a un máximo de 65535 (cifras más altas quedarán afectadas por el desbordamiento).

source: Line up corresponding items vertically.
es: Alinear elementos correspondientes verticalmente.

source: Line up corresponding things vertically, especially if it'd be too long to fit on one line anyway.
es: Alinee verticalmente los elementos correspondientes, especialmente si no caben en una sola línea.

source: Line up your transliterations when it makes sense:
es: Alinee las transliteraciones cuando sea adecuado:

source: Linear history is something that gets lost with every commit on blead, but a final rebase makes the history linear again, making it easier for future maintainers to see what has happened.
es: El historial deja de ser lineal cada vez que se realiza una confirmación en blead, pero una reorganización final restablece la linealidad del historial, lo que facilita a los futuros mantenedores la labor de comprobar los cambios realizados.

source: Linking can generally be static or dynamic, which has nothing to do with static or dynamic scoping.
es: En general, la vinculación puede ser estática o dinámica; esto no tiene nada que ver con el control de ámbito estático o dinámico.

source: List assignment in scalar context returns the number of elements produced by the expression on the right side of the assignment:
es: La asignación de una lista en contexto de escalar devuelve el número de elementos producidos por la expresión en el lado derecho de la asignación:

source: List values are denoted by separating individual values by commas (and enclosing the list in parentheses where precedence requires it):
es: Una lista se especifica escribiendo los valores individuales separados por comas (si la precedencia lo requiere, la lista debe escribirse entre paréntesis):

source: Lists may be assigned to only when each element of the list is itself legal to assign to:
es: Solo se puede asignar a una lista si cada elemento de la lista permite la asignación:

source: Local branches can be configured to automerge (on pull) from a designated remote tracking branch.
es: Las ramas locales se pueden configurar para realizar una combinación automática (al traer cambios) desde una rama de seguimiento remoto designada.

source: Logical alternatives in L</Boolean> expressions are separated with either C<||> or C<or>.
es: En expresiones L<booleanas|/booleano>, las alternativas lógicas se separan mediante C<||> u C<or>.

source: Long lines broken after an operator (except C<and> and C<or>).
es: A continuación de un operador (excepto C<and> y C<or>), las líneas largas deben dividirse.

source: Look at pp_system or use my_popen
es: Vea pp_system o use my_popen

source: Look for F<.xs> and F<.c> files, which normally denote that the distribution must be compiled, and you cannot install it "out of the box." (See L<"PORTABILITY">.)
es: Vea si contiene archivos F<.xs> y F<.c>, que normalmente indican que no se puede instalar la distribución sin compilarla antes (vea L<"PORTABILIDAD">).

source: Look-around assertions are zero-width patterns which match a specific pattern without including it in C<$&>.
es: Las aserciones de inspección (I<look-around>) son patrones de ancho cero que detectan un patrón específico sin incluirlo en C<$&>.

source: Look-behind matches text up to the current match position, look-ahead matches text following the current match position.
es: La inspección hacia atrás (I<look-behind>) coincide con texto hasta la posición actual de coincidencia, mientras que la inspección hacia adelante (I<look-ahead>) coincide con texto que sigue a la posición actual de coincidencia.

source: Looking at your I<Oxford English Dictionary> through a microscope.
es: Consultar en el I<Diccionario de Inglés Oxford> con un microscopio.

source: Loosely, any predefined set of characters so used.
es: En un sentido informal, cualquier conjunto de caracteres predefinido que se use para ello.

source: Loosely, the act of using globs and similar symbols to do pattern matching.
es: En un sentido informal, el acto de usar globs y símbolos similares para detectar patrones.

source: Magical things happen when you diddle those variables.
es: Cuando se hacen trampas con estas variables, suceden cosas mágicas.

source: Mail headers as defined by RFC 822 are continued by putting a space or tab I<after> the newline.
es: Los encabezados de correo definidos en RFC 822 se continúan colocando un espacio o una tabulación I<a continuación> del carácter de nueva línea.

source: Maintenance versions should only be altered to add critical bug fixes, see L<perlpolicy>.
es: Las versiones de mantenimiento sólo se deben modificar para corregir errores graves; vea L<perlpolicy>.

source: Make sure the newlines for the modules are in Mac format, not Unix format.
es: Asegúrese de que los saltos de línea de los módulos están en el formato de Mac, no en el de Unix.

source: Make sure you have MMS (from Digital) or the freeware MMK ( available from MadGoat at http://www.madgoat.com ).
es: Asegúrese de que dispone de MMS (de Digital) o el software gratuito MMK ( disponible en MadGoat, en http://www.madgoat.com ).

source: Make sure you have a good commit message.
es: Asegúrese de escribir un mensaje de confirmación adecuado.

source: Make sure you have the appropriate permissions to install the module in your Perl 5 library directory.
es: Asegúrese de que tiene los permisos adecuados para instalar el módulo en el directorio de biblioteca de Perl 5.

source: Malcolm 5.004_50 1997-Sep-09 The 5.005 development track.
es: Malcolm 5.004_50 1997-Sep-09 Serie de desarrollo de v5.005.

source: Many cities around the world have local Perl Mongers chapters.
es: En muchas ciudades del mundo hay grupos locales de Perl Mongers.

source: Many error messages report both values, if available.
es: Muchos mensajes de error notifican ambos valores (si están disponibles).

source: Many good books have been written about Perl--see the section later in L for more details.
es: Se han escrito muchos libros buenos sobre Perl. Encontrará más información en una sección posterior de L.

source: Many have abandoned this discipline and now communicate via an Esperanto-like language called Perl.
es: Muchos han abandonado esta disciplina y ahora se comunican en un lenguaje similar al Esperanto denominado Perl.

source: Many languages (including Perl) allow identifiers that start with a letter and contain letters and digits.
es: Muchos lenguajes (Perl incluido) permiten que los identificadores empiecen por una letra y contengan letras y dígitos.

source: Many of the important subroutines and functions you use aren't direct system calls, but are built up in one or more layers above the system call level.
es: Muchas de las subrutinas y funciones importantes que se usan no son llamadas de sistema directas, sino que se crean una o varias capas por encima del nivel de llamada de sistema.

source: Many of the beginner-level books, too, go over basic features and techniques that are still valid today.
es: Muchos de los libros para principiantes describen características y técnicas básicas que mantienen su vigencia.

source: Many operators can be combined with a C<=> as follows:
es: Muchos operadores se pueden combinar con un signo C<=> de la manera siguiente:

source: Many other more specific chats are also hosted on the network.
es: Muchos otros sitios de charla más específicos también se encuentran alojados en la red.

source: Many people think that Unicode and UTF-8 are the same thing, but they're not.
es: Muchas personas creen que Unicode es lo mismo que UTF-8, pero se equivocan.

source: Many regular expression constructs don't work on EBCDIC platforms.
es: Muchas construcciones de expresiones regulares no funcionan en plataformas EBCDIC.

source: Many standard I/O libraries automatically set up line buffering on output that is going to the terminal.
es: Muchas bibliotecas de E/S estándar configuran automáticamente el almacenamiento en búfer de líneas en la salida que se dirige al terminal.

source: Many standard properties are defined for L</Unicode>.
es: Hay muchas propiedades estándar definidas para L</Unicode>.

source: Match 0 or 1 time, not greedily
es: 0 o 1 veces, sin avaricia

source: Match 0 or more times, not greedily
es: 0 o más veces, sin avaricia

source: Match 1 or more times, not greedily
es: 1 o más veces, sin avaricia

source: Match at least n but not more than m times, not greedily
es: Al menos n veces, pero no más de m veces, sin avaricia

source: Match at least n times, not greedily
es: Al menos n veces, sin avaricia

source: Match exactly n times, not greedily (redundant)
es: Exactamente n veces, sin avaricia (redundante)

source: Matches C<yes-pattern> if C<condition> yields a true value, matches C<no-pattern> otherwise.
es: Busca C<patrón-sí> si C<condición> devuelve un valor verdadero; si no, busca C<patrón-no>.

source: Matches as C<SSS...S> (repeated as many times as necessary).
es: Coincide con C<SSS...S> (repetido tantas veces como sea necesario).

source: Matches as C<S{max}|S{max-1}|...|S{min+1}|S{min}>.
es: Coincide con C<S{máx}|S{máx-1}|...|S{mín+1}|S{mín}>.

source: Matches as C<S{min}|S{min+1}|...|S{max-1}|S{max}>.
es: Coincide con C<S{mín}|S{mín+1}|...|S{máx-1}|S{máx}>.

source: Matches the best match for C<S> and only that.
es: Coincide con la mejor coincidencia de C<S> y solo con esa.

source: Matching operations can have various modifiers.
es: En las operaciones de detección de coincidencias se pueden usar varios modificadores.

source: Mathematical jargon for a list of L<scalar values|/scalar value>.
es: En jerga matemática, una lista de L<valores escalares|/valor escalar>.

source: Mathematically speaking, it's returning from an unsuccessful recursion on a tree of possibilities.
es: En términos matemáticos, consiste en volver de una recursión que no ha finalizado correctamente en un árbol de posibilidades.

source: Mathematically, a mapping of each of a set of input values to a particular output value.
es: En matemáticas es una correspondencia entre los distintos valores del conjunto de valores de entrada y un valor de salida específico.

source: Maybe you should, too.
es: Es posible que a usted también le resulte útil.

source: Means you can still run your old program because we didn't break any of the features or bugs it was relying on.
es: Significa que aún puede usar sus programas antiguos porque no hemos modificado ninguna de las características o errores en los que se basaban.

source: Means you don't have to pay money to get it, but the copyright on it may still belong to someone else (like Larry).
es: Significa que no tiene que pagar a nadie para obtenerlo, pero los derechos de autor pueden pertenecer a alguien (como Larry).

source: Means you're not in legal trouble if you give a bootleg copy of it to your friends and we find out about it.
es: Significa que si proporciona copias piratas a sus amigos y nos enteramos, no está infringiendo las leyes.

source: Method resolution order only matters in the case of multiple inheritance.
es: El orden de resolución de métodos solo es interesante en el caso de la herencia múltiple.

source: Methods are always written to receive the object as their first argument:
es: Los métodos siempre se programan de forma que el primer argumento recibido sea el objeto:

source: Mnemonic for C<(?^...)>: A fresh beginning since the usual use of a caret is to match at the beginning.
es: Mnemotécnico para C<(?^...)>: un nuevo comienzo, ya que el uso normal de este signo es coincidir con el comienzo de la cadena.

source: Modifiers that relate to the interpretation of the regular expression inside are listed below.
es: Se muestran a continuación los modificadores relacionados con la interpretación de una expresión regular.
